artillery.yml
config:
  target: http://localhost:3000 # change to https://mindgarden.vercel.app/ for testing on vercel
  phases:
    - duration: 20
      arrivalRate: 1
  engines:
    playwright:
      launchOptions:
        headless: true
  processor: './src/tests/load/artillery/load.ts'
scenarios:
  - engine: playwright
    testFunction: 'artilleryScript'