artillery.yml
config:
  target: https://mindgarden.vercel.app/ # change to localhost:3000 for local testing
  phases:
    - duration: 20
      arrivalRate: 1
  engines:
    playwright: 
      launchOptions:
        headless: false
  processor: './src/tests/load/artillery/login.ts'
scenarios:
  - engine: playwright
    testFunction: 'artilleryScript'